---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet{System.Double})
source: html/f4cf6032-f724-525b-fd7e-9eb72904c78a.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	ISet<double> values
)
```

## Parameters
- **name** (`System.String`)
- **values** (`System.Collections.Generic.ISet < Double >`)